import 'package:es28/main.dart';
import 'package:get/get.dart';
import 'package:intl/intl.dart';

class ElathakerController extends GetxController{

  List count=[];
  @override
  void onInit() {
    intialData();
    super.onInit();
  }

  intialData(){
    count.length = adhkar.length;
    if(!checkDate('Asr')&&checkDate('Fajr') &&myBox?.get("athakertime")==1) {
      count.fillRange(0, adhkar.length, 0);
      myBox?.put("athakerCount",count);
      myBox?.put("athakertime",2);
    }
    else if(checkDate('Asr') &&myBox?.get("athakertime")==2) {
      count.fillRange(0, adhkar.length, 0);
      myBox?.put("athakerCount",count);
      myBox?.put("athakertime",1);
    }
    else if(myBox?.get("athakerCount")!=null&&myBox?.get("athakertime")!=null){
      count = myBox?.get("athakerCount");
    }
    else{
      count.fillRange(0, adhkar.length, 0);
      myBox?.put("athakertime",1);
    }
  }

  onTap(int max,int index){
    if(max > count[index]){
      count[index]=count[index]+1;
      myBox?.put("athakerCount",count);
    }
    update();
  }

  bool checkDate(String name){
   String time =myBox?.get("time")[name]??"";
   String currntTime= DateFormat('H:M').format(DateTime.now().add(const Duration(hours: 1)));
   int resulte =currntTime.compareTo(time);
   return (resulte>0);
  }

  List<List<dynamic>> adhkar = [
    ["قراءة آية الكرسي: {الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤده حفظهما وهو العلي العظيم} (البقرة:255)", 1],
    ["سورة الإخلاص، الفلق، والناس", 3],
    ["أصبحنا وأصبح الملك لله والحمد لله لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ربِ اسألك خير ما في هذا اليوم وخير ما بعده واعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ اعوذ بك من الكسل وسوء الكبر ربِّ اعوذ بك من عذاب في النار وعذاب في القبر.", 1],
    ["اللهم إني أسألك خير هذا اليوم وخير ما بعده وأعوذ بك من شر هذا اليوم وشر ما بعده. اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي، فإنه لا يغفر الذنوب إلا أنت", 1],
    ["اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت, من قالها عشر مرات حين يمسي فمات من ليلته دخل الجنة.", 10],
    ["بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم", 3],
    ["رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد ﷺ نبيًا ورسولًا", 3],
    ["حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم", 7],
    ["اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين وقهر الرجال.", 1],
    ["اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية: في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أُغتال من تحتي", 1],
    ["اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يديَّ ومن خلفي، وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي.", 1],
    ["لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير", 10],
    ["سبحان الله وبحمده", 100],
    ["أعوذ بكلمات الله التامات من شر ما خلق", 3],
    ["اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر.", 1],
    ["اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت", 3],
    ["اللهم إني أعوذ بك من الكفر والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت", 3],
    ["اللهم بك أصبحنا وبك أمسينا، وبك نحيا وبك نموت، وإليك النشور.", 1],
    ["اللهم إني أعوذ بك من شر نفسي، ومن شر كل دابة أنت آخذ بناصيتها، إن ربي على صراط مستقيم.", 1],
    ["اللهم صل وسلم على نبينا محمد", 10],
  ];
}